---
kind: type
id: T:Autodesk.Revit.DB.ReferencePointArrayIterator
source: html/42641f66-dfb0-6c29-3913-78f41cdfc9c7.htm
---
# Autodesk.Revit.DB.ReferencePointArrayIterator

An iterator to a reference array.

## Syntax (C#)
```csharp
public abstract class ReferencePointArrayIterator : APIObject,
	IEnumerator
```